phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
static const uint8_t libdma_reqsUartRx[] = {
	[usart1] = dma_req_usart1_rx,
	[usart2] = dma_req_usart2_rx,
	[usart3] = dma_req_usart3_rx,
	[uart4] = dma_req_uart4_rx,
	[uart5] = dma_req_uart5_rx,
	[usart6] = dma_req_usart6_rx,
	[uart7] = dma_req_uart7_rx,
	[uart8] = dma_req_uart8_rx,
	[uart9] = dma_req_uart9_rx,
	[usart10] = dma_req_usart10_rx,
};


static const uint8_t libdma_reqsUartTx[] = {
	[usart1] = dma_req_usart1_tx,
	[usart2] = dma_req_usart2_tx,
	[usart3] = dma_req_usart3_tx,
	[uart4] = dma_req_uart4_tx,
	[uart5] = dma_req_uart5_tx,
	[usart6] = dma_req_usart6_tx,
	[uart7] = dma_req_uart7_tx,
	[uart8] = dma_req_uart8_tx,
	[uart9] = dma_req_uart9_tx,
	[usart10] = dma_req_usart10_tx,
};


static const uint8_t libdma_reqsSpiRx[] = {
	[spi1] = dma_req_spi1_rx,
	[spi2] = dma_req_spi2_rx,
	[spi3] = dma_req_spi3_rx,
	[spi4] = dma_req_spi4_rx,
	[spi5] = dma_req_spi5_rx,
	[spi6] = dma_req_spi6_rx,
};


static const uint8_t libdma_reqsSpiTx[] = {
	[spi1] = dma_req_spi1_tx,
	[spi2] = dma_req_spi2_tx,
	[spi3] = dma_req_spi3_tx,
	[spi4] = dma_req_spi4_tx,
	[spi5] = dma_req_spi5_tx,
	[spi6] = dma_req_spi6_tx,
};


static const uint8_t libdma_reqsTimUpd[] = {
	[pwm_tim1] = dma_req_tim1_upd,
	[pwm_tim2] = dma_req_tim2_upd,
	[pwm_tim3] = dma_req_tim3_upd,
	[pwm_tim4] = dma_req_tim4_upd,
	[pwm_tim5] = dma_req_tim5_upd,
	[pwm_tim6] = dma_req_tim6_upd,
	[pwm_tim7] = dma_req_tim7_upd,
	[pwm_tim8] = dma_req_tim8_upd,
	[pwm_tim9] = dma_req_invalid,
	[pwm_tim10] = dma_req_invalid,
	[pwm_tim11] = dma_req_invalid,
	[pwm_tim12] = dma_req_invalid,
	[pwm_tim13] = dma_req_invalid,
	[pwm_tim14] = dma_req_invalid,
	[pwm_tim15] = dma_req_tim15_upd,
	[pwm_tim16] = dma_req_tim16_upd,
	[pwm_tim17] = dma_req_tim17_upd,
	[pwm_tim18] = dma_req_tim18_upd,
};


static const uint8_t libdma_reqsTimCC1[] = {
	[pwm_tim1] = dma_req_tim1_cc1,
	[pwm_tim2] = dma_req_tim2_cc1,
	[pwm_tim3] = dma_req_tim3_cc1,
	[pwm_tim4] = dma_req_tim4_cc1,
	[pwm_tim5] = dma_req_tim5_cc1,
	[pwm_tim6] = dma_req_invalid,
	[pwm_tim7] = dma_req_invalid,
	[pwm_tim8] = dma_req_tim8_cc1,
	[pwm_tim9] = dma_req_invalid,
	[pwm_tim10] = dma_req_invalid,
	[pwm_tim11] = dma_req_invalid,
	[pwm_tim12] = dma_req_invalid,
	[pwm_tim13] = dma_req_invalid,
	[pwm_tim14] = dma_req_invalid,
	[pwm_tim15] = dma_req_tim15_cc1,
	[pwm_tim16] = dma_req_tim16_cc1,
	[pwm_tim17] = dma_req_tim17_cc1,
	[pwm_tim18] = dma_req_tim18_cc1,
};


static const uint8_t libdma_reqsTimCC2[] = {
	[pwm_tim1] = dma_req_tim1_cc2,
	[pwm_tim2] = dma_req_tim2_cc2,
	[pwm_tim3] = dma_req_tim3_cc2,
	[pwm_tim4] = dma_req_tim4_cc2,
	[pwm_tim5] = dma_req_tim5_cc2,
	[pwm_tim6] = dma_req_invalid,
	[pwm_tim7] = dma_req_invalid,
	[pwm_tim8] = dma_req_tim8_cc2,
	[pwm_tim9] = dma_req_invalid,
	[pwm_tim10] = dma_req_invalid,
	[pwm_tim11] = dma_req_invalid,
	[pwm_tim12] = dma_req_invalid,
	[pwm_tim13] = dma_req_invalid,
	[pwm_tim14] = dma_req_invalid,
	[pwm_tim15] = dma_req_tim15_cc2,
};


static const uint8_t libdma_reqsTimCC3[] = {
	[pwm_tim1] = dma_req_tim1_cc3,
	[pwm_tim2] = dma_req_tim2_cc3,
	[pwm_tim3] = dma_req_tim3_cc3,
	[pwm_tim4] = dma_req_tim4_cc3,
	[pwm_tim5] = dma_req_tim5_cc3,
	[pwm_tim6] = dma_req_invalid,
	[pwm_tim7] = dma_req_invalid,
	[pwm_tim8] = dma_req_tim8_cc3,
};


static const uint8_t libdma_reqsTimCC4[] = {
	[pwm_tim1] = dma_req_tim1_cc4,
	[pwm_tim2] = dma_req_tim2_cc4,
	[pwm_tim3] = dma_req_tim3_cc4,
	[pwm_tim4] = dma_req_tim4_cc4,
	[pwm_tim5] = dma_req_tim5_cc4,
	[pwm_tim6] = dma_req_invalid,
	[pwm_tim7] = dma_req_invalid,
	[pwm_tim8] = dma_req_tim8_cc4,
};


static const uint8_t libdma_memTransferP2M[] = {
	[memTransfer_perIsDst] = dma_req_invalid,
	[memTransfer_perIsSrc] = dma_req_sw_trig,
};


static const uint8_t libdma_memTransferM2P[] = {
	[memTransfer_perIsDst] = dma_req_sw_trig,
	[memTransfer_perIsSrc] = dma_req_invalid,
};

typedef struct {
	const uint8_t *reqsPer2Mem;
	const uint8_t *reqsMem2Per;
	size_t num;
	uint8_t defaultDma;
	uint8_t portPer;
} libdma_perReqLookup_t;


_Static_assert(NELEMS(libdma_reqsSpiRx) == NELEMS(libdma_reqsSpiTx));
_Static_assert(NELEMS(libdma_reqsUartRx) == NELEMS(libdma_reqsUartTx));
_Static_assert(NELEMS(libdma_memTransferP2M) == NELEMS(libdma_memTransferM2P));


static const libdma_perReqLookup_t libdma_reqsLookup[] = {
	[dma_spi] = { libdma_reqsSpiRx, libdma_reqsSpiTx, NELEMS(libdma_reqsSpiRx), DMA_CTRL_GPDMA1, 1 },
	[dma_uart] = { libdma_reqsUartRx, libdma_reqsUartTx, NELEMS(libdma_reqsUartRx), DMA_CTRL_GPDMA1, 1 },
	[dma_tim_upd] = { NULL, libdma_reqsTimUpd, NELEMS(libdma_reqsTimUpd), DMA_CTRL_GPDMA1, 1 },
	[dma_memTransfer] = { libdma_memTransferP2M, libdma_memTransferM2P, NELEMS(libdma_memTransferM2P), DMA_CTRL_HPDMA1, 0 },
	[dma_tim_cap1] = { libdma_reqsTimCC1, NULL, NELEMS(libdma_reqsTimCC1), DMA_CTRL_GPDMA1, 1 },
	[dma_tim_cap2] = { libdma_reqsTimCC2, NULL, NELEMS(libdma_reqsTimCC2), DMA_CTRL_GPDMA1, 1 },
	[dma_tim_cap3] = { libdma_reqsTimCC3, NULL, NELEMS(libdma_reqsTimCC3), DMA_CTRL_GPDMA1, 1 },
	[dma_tim_cap4] = { libdma_reqsTimCC4, NULL, NELEMS(libdma_reqsTimCC4), DMA_CTRL_GPDMA1, 1 },
};


typedef struct {
	uint32_t tr1;
	uint32_t tr2;
	uint32_t br1;
	uint32_t sar;
	uint32_t dar;
	uint32_t llr;
} libdma_chn_setup_t;


/* Type of buffer used for making linked lists, will be allocated in non-cached memory */
typedef uint32_t libdma_listbufs_t[DMA_NUM_CONTROLLERS][DMA_NUM_CHANNELS][XPDMA_LISTBUF_SIZE];


#define MAX_BUFS_PER_TRANSACTION 8
typedef struct {
	const void *buf;
	ssize_t dirSize; /* 0 => don't perform operation (end of list), < 0 => perform per2mem, > 0 => perform mem2per */
} libdma_cacheOp_t;


static const struct dma_setup {
	volatile uint32_t *base;
	int pctl;
	bool isHPDMA;
} dma_setup[DMA_NUM_CONTROLLERS] = {
	[DMA_CTRL_GPDMA1] = {
		.base = GPDMA_BASE,
		.pctl = pctl_gpdma1,
		.isHPDMA = false,
	},
	[DMA_CTRL_HPDMA1] = {
		.base = HPDMA_BASE,
		.pctl = pctl_hpdma1,
		.isHPDMA = true,
	},
};


static struct dma_ctrl {
	struct dma_channel {
		handle_t irqLock;
		handle_t cond;
		handle_t intr;
		libdma_chn_setup_t cx;
		libdma_callback_t *cb;
		void *cb_arg;
		libdma_cacheOp_t cacheOps[MAX_BUFS_PER_TRANSACTION];
		uint8_t priority;
		/* libxpdma_* API functions configure the memory data size and increment at a different point than
		 * older libdma_* functions, so we need to store them in the driver */
		struct {
			uint8_t msize;
			uint8_t minc;
		} oldAPI;
	} chns[DMA_NUM_CHANNELS];
	struct libdma_per pers[DMA_NUM_CHANNELS]; /* Each peripheral takes at least 1 channel, so we can have at most DMA_NUM_CHANNELS peripherals */
	uint32_t chanFree;                        /* Bitmap of free channels */
	handle_t takenLock;
} dma_ctrl[DMA_NUM_CONTROLLERS];

