phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
static struct {
	bool initialized;
	libdma_listbufs_t *listbufs;
	void *dmaMemPtr;
	size_t dmaMemSz;
	handle_t dmaAllocMutex;
	void *dmaAllocPtr;
	size_t dmaAllocSz;
} dma_common;


static void libdma_cleanupTransfer(int dma, int chn);


static inline bool libdma_hasChannelFinished(volatile uint32_t *chnBase)
{
	return (chnBase == NULL) || ((*(chnBase + xpdma_cxsr) & XPDMA_IDLEF) != 0);
}


/* Utility function for verifying arguments and getting the DMA channel */
static bool libxpdma_getDmaAndChannel(const struct libdma_per *per, int dir, int *dma_out, int *chn_out)
{
	if (per == NULL) {
		return false;
	}

	if ((dir != dma_per2mem) && (dir != dma_mem2per)) {
		return false;
	}

	*dma_out = per->dma;
	*chn_out = per->chns[dir];

	if (*chn_out == DMA_NUM_CHANNELS) {
		/* Channel for this direction not allocated */
		return false;
	}

	return true;
}


/* Check if a buffer is inside the DMA-capable memory range */
static bool libxpdma_isInsideDMAMemory(const void *addr, size_t sz)
{
	uintptr_t addr_start = (uintptr_t)addr;
	uintptr_t addr_end = (uintptr_t)addr + sz;
	bool lowerBound = addr_start >= (uintptr_t)dma_common.dmaMemPtr;
	bool noOverflow = addr_end >= addr_start;
	bool upperBound = addr_end <= ((uintptr_t)dma_common.dmaMemPtr + dma_common.dmaMemSz);
	return lowerBound && noOverflow && upperBound;
}


static inline bool libdma_irqToChannel(int irq, unsigned int *dma, unsigned int *chn)
{
	if ((irq >= gpdma1_ch0_irq) && (irq <= gpdma1_ch15_irq)) {
		*dma = DMA_CTRL_GPDMA1;
		*chn = irq - gpdma1_ch0_irq;
		return true;
	}
	else if ((irq >= hpdma1_ch0_irq) && (irq <= hpdma1_ch15_irq)) {
		*dma = DMA_CTRL_HPDMA1;
		*chn = irq - hpdma1_ch0_irq;
		return true;
	}

	return false;
}


static inline int libdma_channelToIRQ(unsigned int dma, unsigned int chn)
{
	if (dma == DMA_CTRL_GPDMA1) {
		return gpdma1_ch0_irq + chn;
	}
	else if (dma == DMA_CTRL_HPDMA1) {
		return hpdma1_ch0_irq + chn;
	}

	return 0;
}


static inline volatile uint32_t *libdma_channelBase(int dma, unsigned int chn)
{
	return dma_setup[dma].base + CHAN_OFFS(chn);
}


static void libdma_cacheOpMem2Per(const void *addr, size_t sz)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_cleanDCache;
	pctl.opDCache.addr = (void *)addr;
	pctl.opDCache.sz = sz;
	platformctl(&pctl);
}


static void libdma_cacheOpPer2Mem(const void *addr, size_t sz)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_cleanInvalDCache;
	pctl.opDCache.addr = (void *)addr;
	pctl.opDCache.sz = sz;
	platformctl(&pctl);
}


static void libxpdma_performCacheOps(int dma, int chn)
{
	libdma_cacheOp_t *ops = dma_ctrl[dma].chns[chn].cacheOps;
	for (size_t i = 0; i < MAX_BUFS_PER_TRANSACTION; i++) {
		if (ops[i].dirSize < 0) {
			libdma_cacheOpPer2Mem(ops[i].buf, -ops[i].dirSize);
		}
		else if (ops[i].dirSize == 0) {
			break;
		}
		else {
			libdma_cacheOpMem2Per(ops[i].buf, ops[i].dirSize);
		}
	}
}


static int libxpdma_addCacheOp(int dma, int chn, const void *buf, size_t size, int dir)
{
	if (size > INT32_MAX) {
		return -EINVAL;
	}

	libdma_cacheOp_t *ops = dma_ctrl[dma].chns[chn].cacheOps;
	ssize_t dirSize = (dir == dma_per2mem) ? -((ssize_t)size) : size;
	for (size_t i = 0; i < MAX_BUFS_PER_TRANSACTION; i++) {
		if (ops[i].buf == buf && ops[i].dirSize == dirSize) {
			return EOK;
		}

		if (ops[i].dirSize == 0) {
			ops[i].buf = buf;
			ops[i].dirSize = dirSize;
			if ((i + 1) < MAX_BUFS_PER_TRANSACTION) {
				ops[i + 1].dirSize = 0;
			}

			return EOK;
		}
	}

	return -ENOMEM;
}


static void libxpdma_clearCacheOps(int dma, int chn)
{
	dma_ctrl[dma].chns[chn].cacheOps[0].dirSize = 0;
}


static void libdma_setLBAR(int dma, int chn, void *addr)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_dmaLinkBaseAddr;
	pctl.dmaLinkBaseAddr.dev = dma_setup[dma].pctl;
	pctl.dmaLinkBaseAddr.channel = chn;
	pctl.dmaLinkBaseAddr.addr = ((uint32_t)addr) & 0xffff0000;
	platformctl(&pctl);
}


static int libdma_irqHandler(unsigned int n, void *arg)
{
	unsigned int dma, chn;
	if (!libdma_irqToChannel(n, &dma, &chn)) {
		return -1;
	}

	volatile uint32_t *chnBase = libdma_channelBase(dma, chn);
	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	uint32_t flags = *(chnBase + xpdma_cxsr) & XPDMA_ALLFLAGS;
	*(chnBase + xpdma_cxfcr) = flags;
	uint8_t handlerFlags = 0;
	if ((flags & XPDMA_HTF) != 0) {
		handlerFlags |= dma_ht;
	}

	if ((flags & XPDMA_TCF) != 0) {
		handlerFlags |= dma_tc;
	}

	if (sChn->cb != NULL) {
		sChn->cb(sChn->cb_arg, handlerFlags);
	}

	/* Check the channel enabled flag to determine if transfer is finished and needs to be cleaned up.
	 * For infinite transfers we set the controller to report TCF after each linked list element,
	 * so despite reporting TCF the channel enabled flag will stay set.
	 * For single transfers, once the transfer is finished TCF will be raised and channel enabled flag
	 * will be cleared by hardware. */
	if ((*(chnBase + xpdma_cxcr) & 1) == 0) {
		libdma_cleanupTransfer(dma, chn);
	}

	return 1;
}


static void libdma_transferOnceCallback(void *cb_arg, int type)
{
	volatile int *doneFlag = cb_arg;
	if ((type & dma_tc) != 0) {
		*doneFlag = 1;
	}
}


/* Cancel transfer if a transfer is in progress and reset interrupt-related variables */
static void libdma_cleanupTransfer(int dma, int chn)
{
	volatile uint32_t *chnBase = libdma_channelBase(dma, chn);

	dataBarier();
	/* Disable DMA interrupts */
	*(chnBase + xpdma_cxcr) &= ~XPDMA_ALLFLAGS;
	dataBarier();
	if (*(chnBase + xpdma_cxcr) & 1) {
		/* Channel is still enabled; need to suspend and reset it before it can be used again */
		*(chnBase + xpdma_cxcr) |= (1 << 2); /* Set SUSP flag */
		dataBarier();
		while ((*(chnBase + xpdma_cxcr) & (1 << 2)) == 0) {
			/* Wait for hardware to suspend the channel */
		}

		*(chnBase + xpdma_cxcr) |= (1 << 1); /* Set RESET flag */
		dataBarier();
	}

	dma_ctrl[dma].chns[chn].cb = NULL;
}


static int libxpdma_findChannel(uint8_t request, int dir, uint32_t *chanFreePtr, uint32_t flags)
{
	if (request == dma_req_invalid) {
		return DMA_NUM_CHANNELS;
	}

	uint32_t chanFreeMasked = *chanFreePtr;
	bool mask2D = false;
	if ((dir == dma_per2mem) && ((flags & LIBXPDMA_ACQUIRE_2D_PER2MEM) != 0)) {
		mask2D = true;
	}
	else if ((dir == dma_mem2per) && ((flags & LIBXPDMA_ACQUIRE_2D_MEM2PER) != 0)) {
		mask2D = true;
	}

	if (mask2D) {
		chanFreeMasked &= DMA_2D_CAPABLE_MASK | (~((1u << DMA_NUM_CHANNELS) - 1));
	}

	int chn = __builtin_ctz(chanFreeMasked);
	if (chn >= DMA_NUM_CHANNELS) {
		return -EBUSY;
	}

	*chanFreePtr &= ~(1u << chn);
	return chn;
}


static int libxpdma_lookupPeripheral(int per, unsigned int num, uint8_t requests[2], uint8_t *defaultDMA, uint8_t *portPer)
{
	if (per >= NELEMS(libdma_reqsLookup)) {
		return -EINVAL;
	}

