phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
	const libdma_perReqLookup_t *l = &libdma_reqsLookup[per];
	if (num >= l->num) {
		return -EINVAL;
	}

	requests[dma_per2mem] = (l->reqsPer2Mem == NULL) ? dma_req_invalid : l->reqsPer2Mem[num];
	requests[dma_mem2per] = (l->reqsMem2Per == NULL) ? dma_req_invalid : l->reqsMem2Per[num];
	if ((requests[dma_per2mem] == dma_req_invalid) && (requests[dma_mem2per] == dma_req_invalid)) {
		/* If both requests are invalid, this peripheral/number combination is invalid */
		return -EINVAL;
	}

	*defaultDMA = l->defaultDma;
	*portPer = l->portPer;
	return EOK;
}


int libxpdma_acquirePeripheral(int per, unsigned int num, uint32_t flags, const struct libdma_per **perP)
{
	uint8_t requests[2];
	uint8_t dma;
	uint8_t portPer;

	int ret = libxpdma_lookupPeripheral(per, num, requests, &dma, &portPer);
	if (ret < 0) {
		return ret;
	}

	if ((flags & (LIBXPDMA_ACQUIRE_FORCE_HPDMA | LIBXPDMA_ACQUIRE_FORCE_GPDMA)) != 0) {
		bool findHPDMA = (flags & LIBXPDMA_ACQUIRE_FORCE_HPDMA) != 0;
		for (dma = 0; dma < DMA_NUM_CONTROLLERS; dma++) {
			if (dma_setup[dma].isHPDMA == findHPDMA) {
				break;
			}
		}

		if (dma >= DMA_NUM_CONTROLLERS) {
			return -EINVAL;
		}
	}

	struct dma_ctrl *ctrl = &dma_ctrl[dma];
	mutexLock(ctrl->takenLock);

	struct libdma_per *p = NULL;
	/* Find a free slot for peripheral information */
	for (int i = 0; i < sizeof(ctrl->pers) / sizeof(ctrl->pers[0]); i++) {
		if (ctrl->pers[i].dma >= DMA_NUM_CONTROLLERS) {
			p = &ctrl->pers[i];
			break;
		}
	}

	if (p == NULL) {
		mutexUnlock(ctrl->takenLock);
		return -ENOMEM;
	}

	/* Find enough unused channels necessary for peripheral */
	uint32_t chanFree = ctrl->chanFree;
	for (int dir = dma_per2mem; dir <= dma_mem2per; dir++) {
		int acqResult = libxpdma_findChannel(requests[dir], dir, &chanFree, flags);
		if (acqResult < 0) {
			mutexUnlock(ctrl->takenLock);
			return acqResult;
		}

		p->chns[dir] = acqResult;
	}

	ctrl->chanFree = chanFree;
	p->dma = dma;
	p->reqs[0] = requests[0];
	p->reqs[1] = requests[1];
	p->portPer = portPer;
	mutexUnlock(ctrl->takenLock);

	*perP = p;
	return EOK;
}


int libxpdma_configureChannel(const struct libdma_per *per, int dir, int priority, handle_t *cond)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	sChn->priority = priority;
	if (sChn->intr == 0) {
		handle_t interruptCond = (cond == NULL) ? sChn->cond : *cond;
		interrupt(libdma_channelToIRQ(dma, chn), libdma_irqHandler, NULL, interruptCond, &sChn->intr);
	}

	sChn->cx.br1 &= 0xffff; /* Zero out upper bits of CxBR1 */

	return EOK;
}


int libxpdma_configurePeripheral(const struct libdma_per *per, int dir, const libdma_peripheral_config_t *cfg)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	const uint8_t max_elSize_log = dma_setup[dma].isHPDMA ? 3 : 2;
	if (cfg->elSize_log > max_elSize_log) {
		return -EINVAL;
	}

	if ((cfg->burstSize == 0) || (cfg->burstSize > 64)) {
		return -EINVAL;
	}

	uint32_t shift = (dir == dma_mem2per) ? 16 : 0;
	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	/* The other half of the register will be configured by libxpdma_configureMemory */
	sChn->cx.tr1 &= ~(XPDMA_CXTR1_INDIVIDUAL_BITS << shift);
	uint32_t cxtr1_temp =
			(1u << 15) | /* secure transfer */
			((per->portPer & 1) << 14) |
			(((cfg->burstSize - 1) & 0x3f) << 4) |
			((cfg->increment != 0) ? (1 << 3) : 0) |
			((cfg->elSize_log & 0x3) << 0);
	sChn->cx.tr1 |= cxtr1_temp << shift;

	/* TCEM bits will be configured by libxpdma_configureMemory */
	sChn->cx.tr2 &= XPDMA_CXTR2_TCEM_MASK;
	if (per->reqs[dir] == dma_req_sw_trig) {
		sChn->cx.tr2 |= XPDMA_CXTR2_MEM2MEM;
	}
	else {
		uint32_t dir_bit = (dir == dma_mem2per) ? XPDMA_CXTR2_MEM2PER : XPDMA_CXTR2_PER2MEM;
		sChn->cx.tr2 |=
				XPDMA_CXTR2_PF_NORMAL |
				XPDMA_CXTR2_PER_BURST |
				dir_bit |
				(per->reqs[dir] & 0xff);
	}

	if (dir == dma_mem2per) {
		sChn->cx.dar = (uint32_t)cfg->addr;
	}
	else {
		sChn->cx.sar = (uint32_t)cfg->addr;
	}

	return EOK;
}


static bool libxpdma_setTransform(uint16_t flags, uint32_t *val)
{
	uint8_t ssize = (*val) & 0x3;
	uint8_t dsize = (*val >> 16) & 0x3;
	uint8_t pamRequest = flags & 0x6;
	*val &= ~0x1C003800;
	if (ssize < dsize) {
		switch (pamRequest) {
			case LIBXPDMA_TRANSFORM_ALIGNR0: *val |= (0 << 11); break;
			case LIBXPDMA_TRANSFORM_ALIGNRS: *val |= (1 << 11); break;
			case LIBXPDMA_TRANSFORM_PACK: *val |= (2 << 11); break;
			case LIBXPDMA_TRANSFORM_ALIGNL: return false;
			default: return false; /* Should never happen */
		}
	}
	else if (ssize > dsize) {
		switch (pamRequest) {
			case LIBXPDMA_TRANSFORM_ALIGNR0: *val |= (0 << 11); break;
			case LIBXPDMA_TRANSFORM_ALIGNRS: *val |= (0 << 11); break;
			case LIBXPDMA_TRANSFORM_PACK: *val |= (2 << 11); break;
			case LIBXPDMA_TRANSFORM_ALIGNL: *val |= (1 << 11); break;
			default: return false; /* Should never happen */
		}
	}

	*val |= ((flags & LIBXPDMA_TRANSFORM_SSWAPB) != 0) ? (1 << 13) : 0;
	*val |= ((flags & LIBXPDMA_TRANSFORM_SWAPB) != 0) ? (1 << 26) : 0;
	*val |= ((flags & LIBXPDMA_TRANSFORM_SWAPH) != 0) ? (1 << 27) : 0;
	*val |= ((flags & LIBXPDMA_TRANSFORM_SWAPW) != 0) ? (1 << 28) : 0;
	return true;
}


static ssize_t libxpdma_configureBuffer(
		int dma,
		int chn,
		const struct libdma_per *per,
		const libdma_transfer_buffer_t *buf,
		int dir,
		libdma_chn_setup_t *setup,
		uint32_t *changeMask_out)
{
	const uint8_t max_elSize_log = dma_setup[dma].isHPDMA ? 3 : 2;
	if ((buf->bufSize == 0) || ((buf->bufSize & ((1 << buf->elSize_log) - 1)) != 0)) {
		return -EINVAL;
	}

	if (buf->elSize_log > max_elSize_log) {
		return -EINVAL;
	}

	uint32_t bufSizeAtSource = buf->bufSize;
	if (dir == dma_per2mem) {
		/* This is a workaround for an unintuitive behavior of the DMA controller.
		 * Block size stored in BR1 register is always counted at *source* element size.
		 * E.g. if you have a 32-bit peripheral and only want low 16 bits stored in the buffer,
		 * BR1 value will have to be twice the size of destination buffer in bytes. */
		uint32_t perElSizeLog = XPDMA_CXTR1_SRC_EL_SIZE(setup->tr1);
		uint8_t pamRequest = buf->transform & 0x6;
		if ((perElSizeLog != buf->elSize_log) && (pamRequest != LIBXPDMA_TRANSFORM_PACK)) {
			bufSizeAtSource = (buf->bufSize >> buf->elSize_log) << perElSizeLog;
		}
	}

	if (bufSizeAtSource > DMA_MAX_LEN) {
		return -EINVAL;
	}

	if ((buf->burstSize == 0) || (buf->burstSize > 64)) {
		return -EINVAL;
	}

	uint32_t changeMask = 0;
	ssize_t n_changes = 0;
	uint32_t shift = (dir == dma_mem2per) ? 0 : 16;
	/* The other half of the register will be configured by libxpdma_configurePeripheral */
	uint32_t tr1_new = setup->tr1;
	tr1_new &= ~(XPDMA_CXTR1_INDIVIDUAL_BITS << shift);
	uint32_t tr1_bits =
			(1u << 15) | /* secure transfer */
			(0 << 14) |  /* Use port 0 for memory (AHB on GPDMA, AXI on HPDMA) */
			((buf->burstSize - 1) << 4) |
			((buf->increment != 0) ? (1 << 3) : 0) |
			(buf->elSize_log & 0x3);
	tr1_new |= tr1_bits << shift;
	if (!libxpdma_setTransform(buf->transform, &tr1_new)) {
		return -EINVAL;
	}

	if (tr1_new != setup->tr1) {
		setup->tr1 = tr1_new;
		changeMask |= XPDMA_CXLLR_UT1;
		n_changes++;
	}

	if ((setup->br1 & 0xffff) != bufSizeAtSource) {
		setup->br1 = (setup->br1 & 0xffff0000) | (bufSizeAtSource & 0xffff);
		changeMask |= XPDMA_CXLLR_UB1;
		n_changes++;
	}

	if (dir == dma_mem2per) {
		setup->sar = (uint32_t)buf->buf;
		changeMask |= XPDMA_CXLLR_USA;
		n_changes++;
	}
	else {
		setup->dar = (uint32_t)buf->buf;
		changeMask |= XPDMA_CXLLR_UDA;
		n_changes++;
	};

	*changeMask_out = changeMask;
	if (buf->isCached != 0) {
		int ret = libxpdma_addCacheOp(dma, chn, buf->buf, buf->bufSize, dir);
		if (ret < 0) {
			return ret;
		}
	}

