phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
	volatile int *flags[2];
	int dmas[2], chns[2];
	if (doM2P != doP2M) {
		/* Waiting on 1 channel */
		int dir = doM2P ? dma_mem2per : dma_per2mem;
		flags[0] = doM2P ? flagMem2Per : flagPer2Mem;
		if (!libxpdma_getDmaAndChannel(per, dir, &dmas[0], &chns[0])) {
			return -EINVAL;
		}

		flags[1] = NULL;
	}
	else if (doP2M) {
		/* Waiting on 2 channels */
		flags[0] = flagPer2Mem;
		if (!libxpdma_getDmaAndChannel(per, dma_per2mem, &dmas[0], &chns[0])) {
			return -EINVAL;
		}

		flags[1] = flagMem2Per;
		if (!libxpdma_getDmaAndChannel(per, dma_mem2per, &dmas[1], &chns[1])) {
			return -EINVAL;
		}
	}
	else {
		return EOK;
	}

	time_t end = 0;
	if (timeout != 0) {
		time_t now;
		gettime(&now, NULL);
		end = now + timeout;
	}

	int ret = libxpdma_waitForChannelIntr(dmas[0], chns[0], flags[0], timeout, end);
	if ((ret == EOK) && (flags[1] != NULL)) {
		/* Both RX and TX channels given - we already waited for RX, now wait for TX */
		volatile uint32_t *chnBase = libdma_channelBase(dmas[1], chns[1]);
		while (!libdma_hasChannelFinished(chnBase)) {
			/* Wait for the other channel to finish */
			if (timeout != 0) {
				time_t now;
				gettime(&now, NULL);
				if (end <= now) {
					ret = -ETIME;
					libdma_cleanupTransfer(dmas[1], chns[1]);
					break;
				}
			}
		}
	}

	return ret;
}


int libxpdma_waitPoll(const struct libdma_per *per, int dir, time_t timeout)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	time_t end = 0;
	if (timeout != 0) {
		time_t now;
		gettime(&now, NULL);
		end = now + timeout;
	}

	int ret = EOK;
	volatile uint32_t *chnBase = libdma_channelBase(dma, chn);
	while (!libdma_hasChannelFinished(chnBase)) {
		/* Wait for the channel to finish */
		if (timeout != 0) {
			time_t now;
			gettime(&now, NULL);
			if (end <= now) {
				ret = -ETIME;
				libdma_cleanupTransfer(dma, chn);
				break;
			}
		}
	}

	return ret;
}


int libxpdma_cancelTransfer(const struct libdma_per *per, int dir)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	libdma_cleanupTransfer(dma, chn);
	return EOK;
}


ssize_t libxpdma_bufferRemaining(const struct libdma_per *per, int dir)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	volatile uint32_t *chnBase = libdma_channelBase(dma, chn);
	/* Only bottom 16 bits contain data. */
	uint32_t nBytesSrc = *(chnBase + xpdma_cxbr1) & 0xffff;
	/* Block size stored in BR1 register is always counted at *source* element size.
	 * If source is memory, then it's OK already.
	 * If source is peripheral, it's at different element size and packing is not applied, we need to calculate
	 * the resulting number of bytes in memory. */
	if (dir == dma_mem2per) {
		return (ssize_t)nBytesSrc;
	}

	uint32_t tr1 = *(chnBase + xpdma_cxtr1);
	if (XPDMA_CXTR1_SRC_EL_SIZE(tr1) != XPDMA_CXTR1_DST_EL_SIZE(tr1) && ((tr1 & XPDMA_CXTR1_PAM_MASK) != XPDMA_CXTR1_PAM_PACK)) {
		return (nBytesSrc >> XPDMA_CXTR1_SRC_EL_SIZE(tr1)) << XPDMA_CXTR1_DST_EL_SIZE(tr1);
	}

	return nBytesSrc;
}


/* Get memory that is DMA capable (non-cached).
 * We can't do this using mmap(), because this is a NOMMU target so the MAP_UNCACHED flag does nothing.
 * Instead, we check the system's memory maps if there's a map with a pre-defined name (`DMA_SYSPAGE_MAP_NAME`).
 */
static int libdma_getDmaMemory(void)
{
	void *dmaMemPtr = NULL;
	size_t dmaMemSz = 0;
	meminfo_t mi;
	mi.page.mapsz = -1;
	mi.entry.kmapsz = -1;
	mi.entry.mapsz = -1;
	mi.maps.mapsz = 0;
	mi.maps.map = NULL;
	meminfo(&mi);

	mi.maps.map = malloc(mi.maps.mapsz * sizeof(mapinfo_t));
	if (mi.maps.map == NULL) {
		return -ENOMEM;
	}

	meminfo(&mi);
	for (int i = 0; i < mi.maps.mapsz; i++) {
		if (strcmp(mi.maps.map[i].name, DMA_SYSPAGE_MAP_NAME) == 0) {
			dmaMemPtr = (void *)mi.maps.map[i].vstart;
			dmaMemSz = mi.maps.map[i].vend - mi.maps.map[i].vstart;
			break;
		}
	}

	free(mi.maps.map);
	if (dmaMemPtr == NULL) {
		return -ENODEV;
	}

	dma_common.dmaMemPtr = dmaMemPtr;
	dma_common.dmaMemSz = dmaMemSz;
	return EOK;
}


void *libdma_malloc(size_t size, size_t alignment)
{
	/* Alignment must be a power of 2 */
	if ((alignment & (alignment - 1)) != 0) {
		return NULL;
	}

	mutexLock(dma_common.dmaAllocMutex);
	size_t misalign = ((uintptr_t)dma_common.dmaAllocPtr & (alignment - 1));
	misalign = (misalign != 0) ? (alignment - misalign) : 0;

	if ((dma_common.dmaAllocSz < misalign) || (size > (dma_common.dmaAllocSz - misalign))) {
		mutexUnlock(dma_common.dmaAllocMutex);
		return NULL;
	}

	dma_common.dmaAllocSz -= misalign;
	dma_common.dmaAllocPtr += misalign;
	void *ret = dma_common.dmaAllocPtr;
	dma_common.dmaAllocSz -= size;
	dma_common.dmaAllocPtr += size;
	mutexUnlock(dma_common.dmaAllocMutex);
	return ret;
}


/* Below are functions for compatibility with old DMA API */


int libdma_acquirePeripheral(int per, unsigned int num, const struct libdma_per **perP)
{
	return libxpdma_acquirePeripheral(per, num, 0, perP);
}


int libdma_configurePeripheral(
		const struct libdma_per *per,
		int dir,
		int priority,
		void *paddr,
		int msize,
		int psize,
		int minc,
		int pinc,
		handle_t *cond)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	int ret = libxpdma_configureChannel(per, dir, priority, cond);
	if (ret < 0) {
		return ret;
	}

	libdma_peripheral_config_t perCfg = {
		.addr = paddr,
		.elSize_log = psize,
		.burstSize = 1,
		.increment = pinc,
	};
	ret = libxpdma_configurePeripheral(per, dir, &perCfg);
	if (ret < 0) {
		return ret;
	}

	dma_ctrl[dma].chns[chn].oldAPI.minc = minc;
	dma_ctrl[dma].chns[chn].oldAPI.msize = msize;

	return EOK;
}


static int libdma_transferInternal(const struct libdma_per *per, int dir, void *addr, size_t len, int mode, time_t timeout, volatile int *doneFlagPtr)
{
	int ret;
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	libdma_transfer_buffer_t buf = {
		.buf = addr,
		.bufSize = len,
		.elSize_log = dma_ctrl[dma].chns[chn].oldAPI.msize,
		.burstSize = 1,
		.increment = dma_ctrl[dma].chns[chn].oldAPI.minc,
		/* Because the older APIs don't have a way to state if the buffer is cacheable,
		 * use a heuristic - if it's not in DMA memory, treat it as cacheable. */
		.isCached = libxpdma_isInsideDMAMemory(addr, len) ? 0 : 1,
	};
	ret = libxpdma_configureMemory(per, dir, 0, &buf, 1);
	if (ret < 0) {
		return ret;
	}

